10/data/attachments/1f6a3baffcb4b245.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_483a4ba2-a522-4cf8-ac9c-d9c3af666742</nif:username>
            <nif:friendToBeAdded>Sierra_home_Actions_14874_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>